{
  "Aries": {
    "insight": "You bring boundless energy and directness to relationships, naturally leading with courage and initiative. This boldness sparks excitement but may cause impatience or conflict if you rush into situations without pause. Balance your enthusiasm by asking your partner’s needs and pacing shared decisions carefully. Harness your natural warrior spirit for mutual growth, not just personal victory."
  },
  "Taurus": {
    "insight": "Your steady, grounded personality creates a stabilizing force in relationships, offering reliability and loyalty. You deeply value comfort and security, but your fixed nature can lead to resistance to change. Embrace flexibility and open-mindedness to keep your bond resilient amid life’s inevitable shifts. Practical acts of care help you nurture love more than grand gestures."
  },
  "Gemini": {
    "insight": "Curiosity and lightness define your connection style10you thrive on communication, new experiences, and mental stimulation. While you offer lively conversation and playful affection, your tendency to get distracted or restless can frustrate partners seeking deeper emotional consistency. Practice active listening and presence to deepen intimacy beyond surface-level exchanges."
  },
  "Cancer": {
    "insight": "You naturally create emotional safety and nurture in your partnerships, attuned to the moods and needs of those you love. This deep care can sometimes translate to emotional sensitivity or withdrawal when feeling overwhelmed. Building clear communication habits and healthy personal boundaries will ensure both partners feel supported and secure."
  },
  "Leo": {
    "insight": "Your warmth, generosity, and vibrant presence make you an engaging partner who loves to uplift and celebrate those close to you. Pride and a strong desire for appreciation can sometimes cause tension if you feel undervalued. Cultivate humility and welcome your partners spotlight as well1true connection shines brightest when both hearts glow."
  },
  "Virgo": {
    "insight": "Practical, attentive, and service-oriented, you bring important grounding and problem-solving to relationships. Your critical eye helps improve situations, but perfectionism or overthinking can create undue stress. Keep empathy front and center; help your partner grow by also appreciating their unique rhythms and imperfections."
  },
  "Libra": {
    "insight": "Harmony and fairness motivate your relational approach; you seek balance, mutual respect, and pleasant interaction. You excel at diplomacy but may avoid conflict or difficult conversations to keep the peace. Embracing honest dialogue as a path to deeper connection will build your relationships roots stronger than surface agreeableness."
  },
  "Scorpio": {
    "insight": "Intensity and emotional depth define your relationships; you crave authentic, transformative bonds that go beyond superficiality. Your loyalty runs deep but can come paired with jealousy or guardedness. Transparency and trust-building practices will unlock true intimacy without fear of vulnerability."
  },
  "Sagittarius": {
    "insight": "You infuse relationships with optimism, adventure, and a love for freedom. Your enthusiasm attracts partners who value growth and exploration, but commitment may sometimes feel confining. Balance independence with presence by fostering shared goals and celebrating moments of stillness together."
  },
  "Capricorn": {
    "insight": "Responsibility, discipline, and long-term planning shape your approach to love. You build relationships deliberately and value reliability above all. Sometimes emotional expression can feel restrained; practicing openness about feelings builds warmth and prevents distance in close bonds."
  },
  "Aquarius": {
    "insight": "Innovative and independent, you bring open-mindedness and progressive thinking to partnerships. You value friendship and intellectual connection but may struggle with emotional vulnerability or conventional relationship expectations. Building trust slowly and honoring partner needs while preserving your freedom creates sustainable harmony."
  },
  "Pisces": {
    "insight": "Compassionate and intuitive, you offer empathy and deep emotional support to your partners. Your dreamy nature can sometimes blur boundaries or lead to idealizing relationships. Grounding yourself in clear communication and shared realities helps cooperation thrive and prevents misunderstandings."
  }
}
