{
  "Aries-Aries": {"insight": "Two dynamite energies! You both love action and excitement, but watch for clashes since you both want to lead. If you channel that passion positively, you’ll fuel each other’s growth."},
  "Aries-Taurus": {"insight": "Your boldness meets steady patience. Aries pushes for quick moves; Taurus prefers to take it slow. Balance your pace and respect each other's approach for harmony."},
  "Aries-Gemini": {"insight": "Adventure and curiosity combine well. Aries brings drive; Gemini adds playful communication. Keep grounding fun with follow-through to avoid frustration."},
  "Aries-Cancer": {"insight": "Direct Aries and sensitive Cancer balance boldness with care. Emotional patience and honest communication help your relationship flourish."},
  "Aries-Leo": {"insight": "A fiery duo filled with energy and passion. Sharing the spotlight and respecting each other’s needs avoids power struggles."},
  "Aries-Virgo": {"insight": "Action-oriented Aries meets practical Virgo. Together, enthusiasm and attention to detail create growth when you honor each other’s pace."},
  "Aries-Libra": {"insight": "Opposites attract—you bring action, they bring balance. Trust and compromise strengthen your bond and create harmony."},
  "Aries-Scorpio": {"insight": "Intensity runs high between bold Aries and profound Scorpio. Open trust and emotional honesty transform potential conflicts into connection."},
  "Aries-Sagittarius": {"insight": "Adventure lovers with high energy and optimism. You inspire each other to grow and explore new horizons together."},
  "Aries-Capricorn": {"insight": "Spontaneous Aries pairs with steady Capricorn. Respect each other’s approach and balance excitement with structure."},
  "Aries-Aquarius": {"insight": "Innovative Aquarius and pioneering Aries create a dynamic, unconventional match. Freedom and connection balance your relationship."},
  "Aries-Pisces": {"insight": "Bold Aries inspires dreamy Pisces, while Pisces teaches emotional depth. Openness builds a meaningful, lasting union."},
  "Taurus-Aries": {"insight": "See Aries–Taurus above."},
  "Taurus-Taurus": {"insight": "You both seek stability and comfort, creating a peaceful, loyal relationship. Be cautious of stubbornness and ensure you remain open to growth to avoid stagnation."},
  "Taurus-Gemini": {"insight": "Your steady nature grounds Gemini’s restless mind, but their changeability may disrupt your need for routine. Patience and flexible communication will help you find common ground."},
  "Taurus-Cancer": {"insight": "A nurturing, emotionally secure pairing. You both value home and loyalty, which builds a warm, dependable connection."},
  "Taurus-Leo": {"insight": "Fixed earth meets fixed fire; you both have strong wills. Leo’s desire for attention and Taurus’ need for comfort can clash unless you honor each other’s priorities."},
  "Taurus-Virgo": {"insight": "Practical and grounded, you support each other well in daily life. Shared values and attention to detail create a harmonious match."},
  "Taurus-Libra": {"insight": "Both appreciate beauty and harmony, though Taurus’ steadiness contrasts Libra’s indecisiveness. Open dialogue and clear boundaries benefit the relationship."},
  "Taurus-Scorpio": {"insight": "Opposites attract with depth and passion. Taurus seeks solidity while Scorpio explores emotional intensity, making trust essential."},
  "Taurus-Sagittarius": {"insight": "Stability meets freedom. Sagittarius’ need to explore clashes with Taurus’ groundedness; mutual respect for differences is needed."},
  "Taurus-Capricorn": {"insight": "Strong earth connection with shared goals creates stability. You both work hard and value lasting security."},
  "Taurus-Aquarius": {"insight": "Fixed signs with very different values. Taurus prefers familiar comfort; Aquarius craves innovation and change. Open-mindedness is key."},
  "Taurus-Pisces": {"insight": "Gentle and supportive pairing. Pisces’ sensitivity complements Taurus’ steadfastness, encouraging emotional balance."}
}
